OpenFOAM_Examples/Quasi_DNS_Dowtherm_Mixed_Conv/quasiDNSCase1/Allrun
#!/bin/sh
cd ${0%/*} || exit 1                        # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions    # Tutorial run functions


runApplication blockMesh

#- Run serial
#runApplication $(getApplication)

#- Run parallel
runApplication $(getApplication)


#------------------------------------------------------------------------------
